redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_1nd/redis_result_Gauss82_F_OFF_P2_1nd_20230717183602.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6898.47          ---          ---         2.91458         2.81500         5.75900         6.27100      7578.89 
Gets        27582.72     27582.72         0.00         2.89204         2.79900         5.72700         6.20700     30168.60 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      34481.20     27582.72         0.00         2.89655         2.79900         5.72700         6.23900     37747.50 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.151        0.000
SET       2.479        5.000
SET       2.543       10.000
SET       2.575       15.000
SET       2.623       20.000
SET       2.655       25.000
SET       2.687       30.000
SET       2.719       35.000
SET       2.751       40.000
SET       2.783       45.000
SET       2.815       50.000
SET       2.831       52.500
SET       2.831       55.000
SET       2.847       57.500
SET       2.863       60.000
SET       2.879       62.500
SET       2.895       65.000
SET       2.895       67.500
SET       2.911       70.000
SET       2.927       72.500
SET       2.943       75.000
SET       2.943       76.250
SET       2.959       77.500
SET       2.959       78.750
SET       2.975       80.000
SET       2.991       81.250
SET       2.991       82.500
SET       3.007       83.750
SET       3.023       85.000
SET       3.039       86.250
SET       3.055       87.500
SET       3.055       88.125
SET       3.071       88.750
SET       3.087       89.375
SET       3.087       90.000
SET       3.119       90.625
SET       3.135       91.250
SET       3.167       91.875
SET       3.215       92.500
SET       3.279       93.125
SET       3.391       93.750
SET       3.439       94.062
SET       3.503       94.375
SET       3.583       94.688
SET       3.647       95.000
SET       3.743       95.312
SET       3.839       95.625
SET       3.951       95.938
SET       4.095       96.250
SET       4.479       96.562
SET       4.991       96.875
SET       5.055       97.031
SET       5.119       97.188
SET       5.183       97.344
SET       5.247       97.500
SET       5.311       97.656
SET       5.375       97.812
SET       5.439       97.969
SET       5.503       98.125
SET       5.535       98.281
SET       5.599       98.438
SET       5.631       98.516
SET       5.663       98.594
SET       5.663       98.672
SET       5.695       98.750
SET       5.727       98.828
SET       5.727       98.906
SET       5.759       98.984
SET       5.791       99.062
SET       5.791       99.141
SET       5.823       99.219
SET       5.855       99.258
SET       5.855       99.297
SET       5.855       99.336
SET       5.887       99.375
SET       5.887       99.414
SET       5.919       99.453
SET       5.919       99.492
SET       5.951       99.531
SET       5.951       99.570
SET       5.983       99.609
SET       5.983       99.629
SET       5.983       99.648
SET       5.983       99.668
SET       6.015       99.688
SET       6.015       99.707
SET       6.047       99.727
SET       6.047       99.746
SET       6.047       99.766
SET       6.079       99.785
SET       6.111       99.805
SET       6.111       99.814
SET       6.143       99.824
SET       6.143       99.834
SET       6.143       99.844
SET       6.175       99.854
SET       6.175       99.863
SET       6.207       99.873
SET       6.239       99.883
SET       6.239       99.893
SET       6.303       99.902
SET       6.303       99.907
SET       6.335       99.912
SET       6.367       99.917
SET       6.367       99.922
SET       6.399       99.927
SET       6.431       99.932
SET       6.463       99.937
SET       6.527       99.941
SET       6.591       99.946
SET       6.623       99.951
SET       6.655       99.954
SET       6.687       99.956
SET       6.719       99.958
SET       6.751       99.961
SET       6.815       99.963
SET       6.847       99.966
SET       6.911       99.968
SET       6.975       99.971
SET       7.167       99.973
SET       7.359       99.976
SET       7.583       99.977
SET       7.679       99.978
SET       7.807       99.979
SET       8.511       99.980
SET       8.575       99.982
SET       9.087       99.983
SET       9.663       99.984
SET       9.983       99.985
SET      10.239       99.987
SET      11.583       99.988
SET      11.583       99.988
SET      11.903       99.989
SET      12.991       99.990
SET      13.119       99.990
SET     220.159       99.991
SET     220.159       99.991
SET     220.159       99.992
SET     220.159       99.993
SET     220.159       99.993
SET     220.159       99.994
SET     220.159       99.994
SET     220.159       99.995
SET     220.159       99.995
SET     220.159       99.995
[...]
SET     220.159       99.996
SET     220.159       99.996
SET     220.159       99.996
SET     220.159       99.997
SET     221.183       99.997
SET     221.183       99.997
SET     221.183       99.997
[...]
SET     221.183       99.998
SET     221.183       99.998
SET     221.183       99.998
[...]
SET     221.183       99.999
SET     221.183       99.999
SET     221.183       99.999
[...]
SET     223.231       99.999
SET     223.231       99.999
SET     223.231       99.999
[...]
SET     223.231      100.000
SET     223.231      100.000
SET     223.231      100.000
[...]
SET     227.327      100.000
SET     227.327      100.000
---
GET       0.191        0.000
GET       2.479        5.000
GET       2.527       10.000
GET       2.575       15.000
GET       2.607       20.000
GET       2.655       25.000
GET       2.687       30.000
GET       2.719       35.000
GET       2.751       40.000
GET       2.767       45.000
GET       2.799       50.000
GET       2.815       52.500
GET       2.831       55.000
GET       2.847       57.500
GET       2.847       60.000
GET       2.863       62.500
GET       2.879       65.000
GET       2.895       67.500
GET       2.911       70.000
GET       2.911       72.500
GET       2.927       75.000
GET       2.943       76.250
GET       2.943       77.500
GET       2.959       78.750
GET       2.959       80.000
GET       2.975       81.250
GET       2.975       82.500
GET       2.991       83.750
GET       3.007       85.000
GET       3.023       86.250
GET       3.039       87.500
GET       3.039       88.125
GET       3.055       88.750
GET       3.055       89.375
GET       3.071       90.000
GET       3.087       90.625
GET       3.103       91.250
GET       3.119       91.875
GET       3.151       92.500
GET       3.199       93.125
GET       3.263       93.750
GET       3.311       94.062
GET       3.375       94.375
GET       3.455       94.688
GET       3.535       95.000
GET       3.615       95.312
GET       3.711       95.625
GET       3.807       95.938
GET       3.935       96.250
GET       4.127       96.562
GET       4.767       96.875
GET       4.959       97.031
GET       5.055       97.188
GET       5.119       97.344
GET       5.183       97.500
GET       5.247       97.656
GET       5.311       97.812
GET       5.375       97.969
GET       5.439       98.125
GET       5.503       98.281
GET       5.567       98.438
GET       5.567       98.516
GET       5.599       98.594
GET       5.631       98.672
GET       5.663       98.750
GET       5.695       98.828
GET       5.695       98.906
GET       5.727       98.984
GET       5.759       99.062
GET       5.791       99.141
GET       5.791       99.219
GET       5.823       99.258
GET       5.823       99.297
GET       5.823       99.336
GET       5.855       99.375
GET       5.855       99.414
GET       5.887       99.453
GET       5.887       99.492
GET       5.919       99.531
GET       5.919       99.570
GET       5.951       99.609
GET       5.951       99.629
GET       5.951       99.648
GET       5.983       99.668
GET       5.983       99.688
GET       5.983       99.707
GET       6.015       99.727
GET       6.015       99.746
GET       6.047       99.766
GET       6.047       99.785
GET       6.079       99.805
GET       6.079       99.814
GET       6.079       99.824
GET       6.111       99.834
GET       6.111       99.844
GET       6.111       99.854
GET       6.143       99.863
GET       6.143       99.873
GET       6.175       99.883
GET       6.207       99.893
GET       6.239       99.902
GET       6.239       99.907
GET       6.271       99.912
GET       6.271       99.917
GET       6.303       99.922
GET       6.303       99.927
GET       6.335       99.932
GET       6.367       99.937
GET       6.399       99.941
GET       6.431       99.946
GET       6.463       99.951
GET       6.495       99.954
GET       6.527       99.956
GET       6.591       99.958
GET       6.623       99.961
GET       6.655       99.963
GET       6.719       99.966
GET       6.815       99.968
GET       6.911       99.971
GET       7.039       99.973
GET       7.391       99.976
GET       7.583       99.977
GET       7.743       99.978
GET       7.807       99.979
GET       8.063       99.980
GET       8.511       99.982
GET       8.895       99.983
GET       9.215       99.984
GET      10.111       99.985
GET      10.239       99.987
GET      10.367       99.988
GET      10.815       99.988
GET      10.879       99.989
GET      11.519       99.990
GET      11.839       99.990
GET      11.967       99.991
GET      12.351       99.991
GET      13.055       99.992
GET      13.567       99.993
GET      13.695       99.993
GET     220.159       99.994
GET     220.159       99.994
GET     220.159       99.995
GET     220.159       99.995
GET     220.159       99.995
[...]
GET     220.159       99.996
GET     220.159       99.996
GET     220.159       99.996
GET     220.159       99.997
GET     221.183       99.997
GET     221.183       99.997
GET     221.183       99.997
[...]
GET     221.183       99.998
GET     221.183       99.998
GET     221.183       99.998
[...]
GET     221.183       99.999
GET     221.183       99.999
GET     221.183       99.999
[...]
GET     221.183      100.000
GET     221.183      100.000
GET     223.231      100.000
GET     223.231      100.000
GET     223.231      100.000
[...]
GET     224.255      100.000
GET     224.255      100.000
GET     224.255      100.000
[...]
GET     227.327      100.000
GET     227.327      100.000
---
WAIT      0.000      100.000